Repository: swazzyb12/HackartonEU
Catalog: prototype3/translations/*/LC_MESSAGES/messages.po
Languages: et, hu, lt, pl, sk, sl

source: Home
et: Avaleht
hu: Kezdőlap
lt: Pradžia
pl: Strona główna
sk: Domov
sl: Domov

source: Start Assessment
et: Alusta hindamist
hu: Felmérés megkezdése
lt: Pradėti vertinimą
pl: Rozpocznij ocenę
sk: Začať Hodnotenie
sl: Začni Ocenjevanje

source: Dashboard
et: Juhtpaneel
hu: Vezérlőpult
lt: Valdymo skydelis
pl: Pulpit
sk: Ovládací panel
sl: Nadzorna plošča

source: About
et: Teave
hu: Névjegy
lt: Apie
pl: O nas
sk: O nás
sl: O nas

source: Language
et: Keel
hu: Nyelv
lt: Kalba
pl: Język
sk: Jazyk
sl: Jezik

source: CyberHubs AI Assessment
et: CyberHubs AI hindamine
hu: CyberHubs AI Felmérés
lt: CyberHubs AI vertinimas
pl: Ocena CyberHubs AI
sk: Hodnotenie CyberHubs AI
sl: Ocenjevanje CyberHubs AI

source: Fast, reliable cybersecurity assessments. Solid question bank with smart AI summaries and recommendations.
et: Kiired, usaldusväärsed küberneetilise turvalisuse hinnangud. Tugev küsimuste pank koos nutika AI kokkuvõtete ja soovitustega.
hu: Gyors, megbízható kiberbiztonsági felmérések. Szilárd kérdésbank az intelligens AI-összefoglalások és ajánlások mellett.
lt: Greit, patikimi kibernetinio saugumo vertinimai. Tvirtus klausimų bankas su inteligenčiais AI santraukomis ir rekomendacijomis.
pl: Szybkie, niezawodne oceny bezpieczeństwa cybernetycznego. Solidna baza pytań z inteligentnymi podsumowaniami AI i rekomendacjami.
sk: Rýchle, spoľahlivé posúdenia kybernetickej bezpečnosti. Solídna banka otázok s inteligentnými zhrnutiami AI a odporúčaniami.
sl: Hitre, zanesljive ocene cybersecurity. Trdna banka vprašanj s pametnimi povzetki AI in priporočili.

source: Assessments
et: Hinnangud
hu: Felmérések
lt: Vertinimai
pl: Oceny
sk: Hodnotenia
sl: Ocenjevanja

source: Completed
et: Lõpetatud
hu: Befejezve
lt: Baigta
pl: Ukończone
sk: Dokončené
sl: Zaključeno

source: Average Score
et: Keskmine skoor
hu: Átlagos pontszám
lt: Vidutinis balas
pl: Średni wynik
sk: Priemerný balík
sl: Povprečna Točka

source: Overall Performance
et: Üldine jõudlus
hu: Teljes teljesítmény
lt: Bendras našumas
pl: Ogólna wydajność
sk: Celková Výkonnosť
sl: Splošna Zmogljivost

source: Badges
et: Märgid
hu: Jelvények
lt: Ženklai
pl: Odznaki
sk: Odznamenia
sl: Značke

source: Earned
et: Teenitud
hu: Szerzett
lt: Uždirbti
pl: Zdobyte
sk: Nadobudnutý
sl: Zasluženo

source: Start Your Journey
et: Alusta oma teekonda
hu: Kezdd meg utazásodat
lt: Pradėkite savo kelionę
pl: Rozpocznij swoją podróż
sk: Začnite svoju cestu
sl: Začnite svojo pot

source: Ready to test your cybersecurity knowledge?
et: Kas oled valmis testima oma küberneetilise turvalisuse teadmisi?
hu: Készen állsz a kiberbiztonsági ismereteid tesztelésére?
lt: Ar pasiruošę išbandyti savo kibernetinio saugumo žinias?
pl: Czy jesteś gotów przetestować swoją wiedzę z zakresu bezpieczeństwa cybernetycznego?
sk: Ste pripravení otestovať svoje znalosti z kybernetickej bezpečnosti?
sl: Ste pripravljeni testirati svoje znanje cybersecurity?

source: Begin Assessment
et: Alusta hindamist
hu: Felmérés megkezdése
lt: Pradėti vertinimą
pl: Rozpocznij ocenę
sk: Začať Hodnotenie
sl: Začni Ocenjevanje

source: View Your Progress
et: Vaata oma edusamme
hu: Nézd meg a haladásodat
lt: Peržiūrėkite savo pažangą
pl: Wyświetl swój postęp
sk: Pozrite si svoj Pokrok
sl: Oglejte si svoj napredek

source: Track your learning journey and see how you're improving
et: Jälgi oma õppehetkust ja näe, kuidas paranevad
hu: Kövesd tanulási utazásodat, és nézd meg, hogyan javulsz
lt: Sekite savo mokymosi kelionę ir pamatykite, kaip gerinatis
pl: Śledź swoją podróż edukacyjną i zobacz, jak się poprawiasz
sk: Sledujte svoju cestu učenia sa a vidíte, ako sa zlepšujete
sl: Spremljajte svojo pot učenja in poglejte, kako napredujete

source: Visit Dashboard
et: Külasta juhtpaneeli
hu: Látogass meg a Vezérlőpultra
lt: Apsilankykite valdymo skydely
pl: Odwiedź pulpit
sk: Navštívte Ovládací panel
sl: Obiščite Nadzorno Ploščo

source: CyberHubs AI Assessment Platform. Powered by Google Gemini AI.
et: CyberHubs AI hindamise platvorm. Võimendatud Google Gemini AI-ga.
hu: CyberHubs AI Felmérési Platform. A Google Gemini AI által működtetett.
lt: CyberHubs AI vertinimo platforma. Kurią pagalba Google Gemini AI.
pl: Platforma oceny CyberHubs AI. Zasilana przez Google Gemini AI.
sk: Platforma hodnotenia CyberHubs AI. Poháňané Google Gemini AI.
sl: Platforma za Ocenjevanje CyberHubs AI. Poganja Google Gemini AI.

source: Developed for Hackathon EU 2025
et: Välja töötatud Hackathon EU 2025 jaoks
hu: Kifejlesztve a Hackathon EU 2025-hez
lt: Sukurta Hackathon EU 2025
pl: Opracowane dla Hackathon EU 2025
sk: Vyvinuté pre Hackathon EU 2025
sl: Razvito za Hackathon EU 2025

source: Home - CyberHubs AI Assessment
et: Avaleht - CyberHubs AI hindamine
hu: Kezdőlap - CyberHubs AI Felmérés
lt: Pradžia - CyberHubs AI vertinimas
pl: Strona główna - Ocena CyberHubs AI
sk: Domov - Hodnotenie CyberHubs AI
sl: Domov - Ocenjevanje CyberHubs AI

source: Error
et: Viga
hu: Hiba
lt: Klaida
pl: Błąd
sk: Chyba
sl: Napaka

source: Page not found
et: Leht ei leitud
hu: Oldal nem található
lt: Puslapis nerastas
pl: Strona nie znaleziona
sk: Stránka sa nenašla
sl: Strani ni mogoče najti

source: The page you're looking for doesn't exist
et: Otstavat lehte ei ole olemas
hu: A keresett oldal nem létezik
lt: Ieškomas puslapis neegzistuoja
pl: Szukana strona nie istnieje
sk: Hľadaná stránka neexistuje
sl: Iskana stran ne obstaja

source: Go back to home
et: Liigu tagasi avalehele
hu: Vissza a kezdőlapra
lt: Grįžti į pradžią
pl: Wróć na stronę główną
sk: Vrátite sa na domov
sl: Pojdi nazaj na domov

source: Internal Server Error
et: Serveri sisemine viga
hu: Belső szerverhiba
lt: Vidinė serverio klaida
pl: Wewnętrzny błąd serwera
sk: Interná Chyba Servera
sl: Notranja Napaka Strežnika

source: Something went wrong on our end
et: Meie poolelt läks midagi valesti
hu: Valamilyen hiba történt a mi végünkön
lt: Mūsų pusėje įvyko kažkas negerai
pl: Coś poszło nie tak z naszej strony
sk: Niečo sa pokazilo z našej strany
sl: Na naši strani se je nekaj napačno zgodilo
